type token =
  | INT of (int)
  | BOOL of (bool)
  | ID of (string)
  | LET
  | IN
  | PLUS
  | TIMES
  | MINUS
  | DIV
  | EQ
  | LT
  | IF
  | THEN
  | ELSE
  | LPAR
  | RPAR
  | SEMISEMI
  | AND
  | OR
  | LLet
  | LETAND

open Parsing;;
let _ = parse_error;;
# 2 "parser.mly"
  open Syntax
  (* ここに書いたものは，ExampleParser.mliに入らないので注意 *)
# 30 "parser.ml"
let yytransl_const = [|
  260 (* LET *);
  261 (* IN *);
  262 (* PLUS *);
  263 (* TIMES *);
  264 (* MINUS *);
  265 (* DIV *);
  266 (* EQ *);
  267 (* LT *);
  268 (* IF *);
  269 (* THEN *);
  270 (* ELSE *);
  271 (* LPAR *);
  272 (* RPAR *);
  273 (* SEMISEMI *);
  274 (* AND *);
  275 (* OR *);
  276 (* LLet *);
  277 (* LETAND *);
    0|]

let yytransl_block = [|
  257 (* INT *);
  258 (* BOOL *);
  259 (* ID *);
    0|]

let yylhs = "\255\255\
\001\000\001\000\001\000\001\000\002\000\002\000\006\000\006\000\
\005\000\005\000\004\000\004\000\003\000\003\000\008\000\008\000\
\009\000\009\000\009\000\010\000\010\000\010\000\011\000\011\000\
\011\000\012\000\012\000\012\000\012\000\007\000\000\000"

let yylen = "\002\000\
\005\000\002\000\001\000\002\000\005\000\003\000\006\000\003\000\
\005\000\005\000\006\000\001\000\003\000\001\000\003\000\001\000\
\003\000\003\000\001\000\003\000\003\000\001\000\003\000\003\000\
\001\000\001\000\001\000\001\000\003\000\001\000\002\000"

let yydefred = "\000\000\
\000\000\000\000\026\000\027\000\028\000\000\000\000\000\000\000\
\031\000\000\000\000\000\003\000\000\000\016\000\000\000\000\000\
\025\000\030\000\000\000\004\000\000\000\000\000\000\000\000\000\
\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\029\000\000\000\015\000\000\000\000\000\
\000\000\000\000\023\000\024\000\000\000\000\000\000\000\001\000\
\000\000\010\000\000\000\009\000\000\000\000\000\005\000\000\000\
\000\000\000\000\000\000\007\000\000\000\000\000\000\000"

let yydgoto = "\002\000\
\009\000\019\000\010\000\011\000\052\000\020\000\021\000\013\000\
\014\000\015\000\016\000\017\000"

let yysindex = "\013\000\
\003\255\000\000\000\000\000\000\000\000\031\255\028\255\028\255\
\000\000\020\255\025\255\000\000\044\255\000\000\030\255\026\255\
\000\000\000\000\058\255\000\000\054\255\253\254\033\255\028\255\
\000\000\028\255\028\255\028\255\028\255\028\255\028\255\028\255\
\028\255\028\255\028\255\000\000\044\255\000\000\026\255\026\255\
\039\255\039\255\000\000\000\000\250\254\004\255\254\254\000\000\
\031\255\000\000\031\255\000\000\028\255\055\255\000\000\049\255\
\057\255\020\255\028\255\000\000\028\255\005\255\029\255"

let yyrindex = "\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\051\255\000\000\000\000\109\000\000\000\055\000\001\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\120\000\000\000\019\000\037\000\
\073\000\091\000\000\000\000\000\000\000\003\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\052\255\000\000\000\000\000\000\000\000\027\255"

let yygindex = "\000\000\
\000\000\020\000\249\255\000\000\069\000\021\000\002\000\050\000\
\250\255\027\000\031\000\029\000"

let yytablesize = 397
let yytable = "\022\000\
\022\000\023\000\008\000\003\000\004\000\005\000\006\000\049\000\
\049\000\035\000\048\000\053\000\024\000\001\000\007\000\024\000\
\024\000\008\000\020\000\038\000\050\000\050\000\024\000\024\000\
\051\000\045\000\046\000\047\000\003\000\004\000\005\000\006\000\
\031\000\018\000\032\000\027\000\021\000\028\000\024\000\029\000\
\030\000\025\000\008\000\008\000\027\000\058\000\028\000\024\000\
\036\000\051\000\054\000\062\000\057\000\063\000\019\000\041\000\
\042\000\039\000\040\000\043\000\044\000\026\000\033\000\034\000\
\059\000\060\000\061\000\012\000\011\000\012\000\055\000\056\000\
\017\000\037\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\018\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\013\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\000\000\022\000\022\000\022\000\006\000\
\022\000\000\000\022\000\022\000\000\000\022\000\022\000\000\000\
\022\000\022\000\022\000\022\000\000\000\022\000\020\000\020\000\
\020\000\000\000\020\000\000\000\020\000\020\000\000\000\020\000\
\020\000\000\000\020\000\020\000\020\000\020\000\000\000\020\000\
\021\000\021\000\021\000\000\000\021\000\000\000\021\000\021\000\
\000\000\021\000\021\000\000\000\021\000\021\000\021\000\021\000\
\000\000\021\000\019\000\019\000\000\000\000\000\000\000\000\000\
\000\000\000\000\000\000\019\000\019\000\000\000\019\000\019\000\
\019\000\019\000\000\000\019\000\017\000\017\000\000\000\000\000\
\000\000\000\000\000\000\000\000\000\000\017\000\017\000\000\000\
\017\000\017\000\017\000\017\000\000\000\017\000\018\000\018\000\
\000\000\000\000\000\000\000\000\000\000\000\000\000\000\018\000\
\018\000\000\000\018\000\018\000\018\000\018\000\000\000\018\000\
\014\000\014\000\000\000\000\000\000\000\000\000\000\000\000\000\
\000\000\014\000\014\000\013\000\013\000\014\000\000\000\014\000\
\000\000\014\000\000\000\000\000\013\000\013\000\000\000\000\000\
\013\000\000\000\013\000\000\000\013\000"

let yycheck = "\007\000\
\000\000\008\000\000\000\001\001\002\001\003\001\004\001\004\001\
\004\001\013\001\017\001\014\001\019\001\001\000\012\001\019\001\
\019\001\015\001\000\000\026\000\017\001\017\001\019\001\019\001\
\021\001\033\000\034\000\035\000\001\001\002\001\003\001\005\001\
\007\001\003\001\009\001\006\001\000\000\008\001\019\001\010\001\
\011\001\017\001\015\001\017\001\006\001\053\000\008\001\019\001\
\016\001\021\001\049\000\059\000\051\000\061\000\000\000\029\000\
\030\000\027\000\028\000\031\000\032\000\018\001\005\001\010\001\
\010\001\017\001\010\001\017\001\017\001\001\000\051\000\051\000\
\000\000\024\000\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\000\000\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\000\000\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\000\000\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\255\255\004\001\005\001\006\001\005\001\
\008\001\255\255\010\001\011\001\255\255\013\001\014\001\255\255\
\016\001\017\001\018\001\019\001\255\255\021\001\004\001\005\001\
\006\001\255\255\008\001\255\255\010\001\011\001\255\255\013\001\
\014\001\255\255\016\001\017\001\018\001\019\001\255\255\021\001\
\004\001\005\001\006\001\255\255\008\001\255\255\010\001\011\001\
\255\255\013\001\014\001\255\255\016\001\017\001\018\001\019\001\
\255\255\021\001\004\001\005\001\255\255\255\255\255\255\255\255\
\255\255\255\255\255\255\013\001\014\001\255\255\016\001\017\001\
\018\001\019\001\255\255\021\001\004\001\005\001\255\255\255\255\
\255\255\255\255\255\255\255\255\255\255\013\001\014\001\255\255\
\016\001\017\001\018\001\019\001\255\255\021\001\004\001\005\001\
\255\255\255\255\255\255\255\255\255\255\255\255\255\255\013\001\
\014\001\255\255\016\001\017\001\018\001\019\001\255\255\021\001\
\004\001\005\001\255\255\255\255\255\255\255\255\255\255\255\255\
\255\255\013\001\014\001\004\001\005\001\017\001\255\255\019\001\
\255\255\021\001\255\255\255\255\013\001\014\001\255\255\255\255\
\017\001\255\255\019\001\255\255\021\001"

let yynames_const = "\
  LET\000\
  IN\000\
  PLUS\000\
  TIMES\000\
  MINUS\000\
  DIV\000\
  EQ\000\
  LT\000\
  IF\000\
  THEN\000\
  ELSE\000\
  LPAR\000\
  RPAR\000\
  SEMISEMI\000\
  AND\000\
  OR\000\
  LLet\000\
  LETAND\000\
  "

let yynames_block = "\
  INT\000\
  BOOL\000\
  ID\000\
  "

let yyact = [|
  (fun _ -> failwith "parser")
; (fun __caml_parser_env ->
    let _2 = (Parsing.peek_val __caml_parser_env 3 : 'inbefore) in
    let _4 = (Parsing.peek_val __caml_parser_env 1 : 'boolian_expr) in
    Obj.repr(
# 24 "parser.mly"
                                         ( InEval (_2, _4) )
# 248 "parser.ml"
               : Syntax.command))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 1 : 'syntaxexpression) in
    Obj.repr(
# 25 "parser.mly"
                              ( CExp _1 )
# 255 "parser.ml"
               : Syntax.command))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 0 : 'letexpression) in
    Obj.repr(
# 26 "parser.mly"
                  ( _1 )
# 262 "parser.ml"
               : Syntax.command))
; (fun __caml_parser_env ->
    let _2 = (Parsing.peek_val __caml_parser_env 0 : 'letandexpression) in
    Obj.repr(
# 27 "parser.mly"
                         ( _2 )
# 269 "parser.ml"
               : Syntax.command))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 4 : 'var) in
    let _3 = (Parsing.peek_val __caml_parser_env 2 : 'boolian_expr) in
    let _5 = (Parsing.peek_val __caml_parser_env 0 : 'inbefore) in
    Obj.repr(
# 31 "parser.mly"
                                        ( TempListAdd (_1, _3, _5) )
# 278 "parser.ml"
               : 'inbefore))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 2 : 'var) in
    let _3 = (Parsing.peek_val __caml_parser_env 0 : 'boolian_expr) in
    Obj.repr(
# 32 "parser.mly"
                        ( TempList (_1, _3) )
# 286 "parser.ml"
               : 'inbefore))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 5 : 'var) in
    let _3 = (Parsing.peek_val __caml_parser_env 3 : 'boolian_expr) in
    let _5 = (Parsing.peek_val __caml_parser_env 1 : 'letandexpression) in
    Obj.repr(
# 36 "parser.mly"
                                                         ( AndLet (_1, _3, _5) )
# 295 "parser.ml"
               : 'letandexpression))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 2 : 'var) in
    let _3 = (Parsing.peek_val __caml_parser_env 0 : 'boolian_expr) in
    Obj.repr(
# 37 "parser.mly"
                        ( CDecl (_1, _3) )
# 303 "parser.ml"
               : 'letandexpression))
; (fun __caml_parser_env ->
    let _2 = (Parsing.peek_val __caml_parser_env 3 : 'var) in
    let _4 = (Parsing.peek_val __caml_parser_env 1 : 'boolian_expr) in
    let _5 = (Parsing.peek_val __caml_parser_env 0 : 'letexpression) in
    Obj.repr(
# 41 "parser.mly"
                                          ( LLet (_2, _4, _5) )
# 312 "parser.ml"
               : 'letexpression))
; (fun __caml_parser_env ->
    let _2 = (Parsing.peek_val __caml_parser_env 3 : 'var) in
    let _4 = (Parsing.peek_val __caml_parser_env 1 : 'boolian_expr) in
    Obj.repr(
# 42 "parser.mly"
                                     ( CDecl (_2, _4) )
# 320 "parser.ml"
               : 'letexpression))
; (fun __caml_parser_env ->
    let _2 = (Parsing.peek_val __caml_parser_env 4 : 'boolian_expr) in
    let _4 = (Parsing.peek_val __caml_parser_env 2 : 'boolian_expr) in
    let _6 = (Parsing.peek_val __caml_parser_env 0 : 'boolian_expr) in
    Obj.repr(
# 46 "parser.mly"
                                                        ( EIf(_2,_4,_6) )
# 329 "parser.ml"
               : 'syntaxexpression))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 0 : 'boolian_expr) in
    Obj.repr(
# 47 "parser.mly"
                    ( _1 )
# 336 "parser.ml"
               : 'syntaxexpression))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 2 : 'boolian_expr) in
    let _3 = (Parsing.peek_val __caml_parser_env 0 : 'factor2_expr) in
    Obj.repr(
# 51 "parser.mly"
                                 (EOr(_1,_3))
# 344 "parser.ml"
               : 'boolian_expr))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 0 : 'factor2_expr) in
    Obj.repr(
# 52 "parser.mly"
                                ( _1 )
# 351 "parser.ml"
               : 'boolian_expr))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 2 : 'factor2_expr) in
    let _3 = (Parsing.peek_val __caml_parser_env 0 : 'expr) in
    Obj.repr(
# 56 "parser.mly"
                            ( EAnd(_1,_3))
# 359 "parser.ml"
               : 'factor2_expr))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 0 : 'expr) in
    Obj.repr(
# 57 "parser.mly"
                             ( _1 )
# 366 "parser.ml"
               : 'factor2_expr))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 2 : 'arith_expr) in
    let _3 = (Parsing.peek_val __caml_parser_env 0 : 'arith_expr) in
    Obj.repr(
# 61 "parser.mly"
                                ( EEq(_1,_3) )
# 374 "parser.ml"
               : 'expr))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 2 : 'arith_expr) in
    let _3 = (Parsing.peek_val __caml_parser_env 0 : 'arith_expr) in
    Obj.repr(
# 62 "parser.mly"
                                ( ELt(_1,_3) )
# 382 "parser.ml"
               : 'expr))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 0 : 'arith_expr) in
    Obj.repr(
# 63 "parser.mly"
                                ( _1 )
# 389 "parser.ml"
               : 'expr))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 2 : 'arith_expr) in
    let _3 = (Parsing.peek_val __caml_parser_env 0 : 'factor_expr) in
    Obj.repr(
# 68 "parser.mly"
                                 ( EAdd(_1,_3) )
# 397 "parser.ml"
               : 'arith_expr))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 2 : 'arith_expr) in
    let _3 = (Parsing.peek_val __caml_parser_env 0 : 'factor_expr) in
    Obj.repr(
# 69 "parser.mly"
                                 ( ESub(_1,_3) )
# 405 "parser.ml"
               : 'arith_expr))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 0 : 'factor_expr) in
    Obj.repr(
# 70 "parser.mly"
                                 ( _1 )
# 412 "parser.ml"
               : 'arith_expr))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 2 : 'factor_expr) in
    let _3 = (Parsing.peek_val __caml_parser_env 0 : 'atomic_expr) in
    Obj.repr(
# 74 "parser.mly"
                                  ( EMul(_1,_3) )
# 420 "parser.ml"
               : 'factor_expr))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 2 : 'factor_expr) in
    let _3 = (Parsing.peek_val __caml_parser_env 0 : 'atomic_expr) in
    Obj.repr(
# 75 "parser.mly"
                                  ( EDiv(_1,_3) )
# 428 "parser.ml"
               : 'factor_expr))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 0 : 'atomic_expr) in
    Obj.repr(
# 76 "parser.mly"
                                  ( _1 )
# 435 "parser.ml"
               : 'factor_expr))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 0 : int) in
    Obj.repr(
# 80 "parser.mly"
                   ( EConstInt(_1) )
# 442 "parser.ml"
               : 'atomic_expr))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 0 : bool) in
    Obj.repr(
# 81 "parser.mly"
                   ( EConstBool(_1) )
# 449 "parser.ml"
               : 'atomic_expr))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 0 : string) in
    Obj.repr(
# 82 "parser.mly"
                   ( EVar(_1) )
# 456 "parser.ml"
               : 'atomic_expr))
; (fun __caml_parser_env ->
    let _2 = (Parsing.peek_val __caml_parser_env 1 : 'expr) in
    Obj.repr(
# 83 "parser.mly"
                   ( _2 )
# 463 "parser.ml"
               : 'atomic_expr))
; (fun __caml_parser_env ->
    let _1 = (Parsing.peek_val __caml_parser_env 0 : string) in
    Obj.repr(
# 87 "parser.mly"
       ( _1 )
# 470 "parser.ml"
               : 'var))
(* Entry toplevel *)
; (fun __caml_parser_env -> raise (Parsing.YYexit (Parsing.peek_val __caml_parser_env 0)))
|]
let yytables =
  { Parsing.actions=yyact;
    Parsing.transl_const=yytransl_const;
    Parsing.transl_block=yytransl_block;
    Parsing.lhs=yylhs;
    Parsing.len=yylen;
    Parsing.defred=yydefred;
    Parsing.dgoto=yydgoto;
    Parsing.sindex=yysindex;
    Parsing.rindex=yyrindex;
    Parsing.gindex=yygindex;
    Parsing.tablesize=yytablesize;
    Parsing.table=yytable;
    Parsing.check=yycheck;
    Parsing.error_function=parse_error;
    Parsing.names_const=yynames_const;
    Parsing.names_block=yynames_block }
let toplevel (lexfun : Lexing.lexbuf -> token) (lexbuf : Lexing.lexbuf) =
   (Parsing.yyparse yytables 1 lexfun lexbuf : Syntax.command)
